## DataFrame: Modificación de los nombres de filas

In [384]:
import pandas as pd

In [386]:
filas = 'ventas1 ventas2 ventas3'. split()
columnas = 'zonaA zonaB zonaC'. split()
datos = [[100, 200, 250], [210, 300, 425], [250, 310, 124]]
dataframe = pd.DataFrame(datos, filas, columnas)

In [388]:
dataframe

         zonaA  zonaB  zonaC
ventas1    100    200    250
ventas2    210    300    425
ventas3    250    310    124

In [390]:
nuevas_filas = 'dia1, dia2, dia3'.split()
nuevas_filas

['dia1,', 'dia2,', 'dia3']

In [392]:
dataframe['dias'] = nuevas_filas
dataframe

         zonaA  zonaB  zonaC   dias
ventas1    100    200    250  dia1,
ventas2    210    300    425  dia2,
ventas3    250    310    124   dia3

In [394]:
dataframe.set_index('dias')

       zonaA  zonaB  zonaC
dias
dia1,    100    200    250
dia2,    210    300    425
dia3     250    310    124

In [396]:
dataframe

         zonaA  zonaB  zonaC   dias
ventas1    100    200    250  dia1,
ventas2    210    300    425  dia2,
ventas3    250    310    124   dia3

In [398]:
dataframe = dataframe.set_index('dias')

In [400]:
dataframe

       zonaA  zonaB  zonaC
dias
dia1,    100    200    250
dia2,    210    300    425
dia3     250    310    124

## Pandas: Tratamiento datos nulos o sin valor

In [403]:
import  numpy as np
import pandas as pd

In [405]:
diccionario = {'A':[4,5, np.nan], 'B':[6,1,5], 'C':[np.nan, 4, np.nan]}

In [407]:
dataframe = pd.DataFrame(diccionario)

In [409]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [411]:
dataframe.dropna()

     A  B    C
1  5.0  1  4.0

In [413]:
dataframe.dropna(axis=1)

   B
0  6
1  1
2  5

In [415]:
dataframe

     A  B    C
0  4.0  6  NaN
1  5.0  1  4.0
2  NaN  5  NaN

In [417]:
dataframe.fillna(value=100)

       A  B      C
0    4.0  6  100.0
1    5.0  1    4.0
2  100.0  5  100.0

In [419]:
valor_medio = dataframe.mean()
valor_medio

A    4.5
B    4.0
C    4.0
dtype: float64

## Pandas - Agrupación de datos

In [422]:
import  numpy as np
import pandas as pd

In [424]:
diccionario = {'dias':['dia1', 'dia1', 'dia2', 'dia2', 'dia3'], 'vendedores':['Antonio', 'Maria','Jose', 'Marta', 'Juan'], 'ventas':
                      [100, 400, 200, 500, 300] }

In [426]:
dataframe = pd. DataFrame(diccionario)

In [428]:
dataframe

   dias vendedores  ventas
0  dia1    Antonio     100
1  dia1      Maria     400
2  dia2       Jose     200
3  dia2      Marta     500
4  dia3       Juan     300

In [430]:

dataframe.groupby('dias').mean(numeric_only=True)

      ventas
dias
dia1   250.0
dia2   350.0
dia3   300.0

In [432]:

dataframe.groupby('dias').sum(numeric_only=True)

      ventas
dias
dia1     500
dia2     700
dia3     300

In [434]:
dataframe.groupby('dias').describe()

     ventas
      count   mean         std    min    25%    50%    75%    max
dias
dia1    2.0  250.0  212.132034  100.0  175.0  250.0  325.0  400.0
dia2    2.0  350.0  212.132034  200.0  275.0  350.0  425.0  500.0
dia3    1.0  300.0         NaN  300.0  300.0  300.0  300.0  300.0

## Pandas - Combinar DataFrame

In [437]:
import  numpy as np
import pandas as pd

In [439]:
diccionario = {'A':[1, 2, 3], 'B':[4, 5, 6], 'C':[7, 8, 9]}

In [441]:
dataframe1 = pd.DataFrame(diccionario)
dataframe1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [443]:
diccionario = {'A':[11, 12, 13], 'B':[14, 15, 16], 'C':[17, 18,19]}

In [445]:
dataframe2 = pd.DataFrame(diccionario2)
dataframe2

    C   D
0  11  14
1  12  15
2  13  16

In [447]:
pd.concat([dataframe1, dataframe2])

     A    B   C     D
0  1.0  4.0   7   NaN
1  2.0  5.0   8   NaN
2  3.0  6.0   9   NaN
0  NaN  NaN  11  14.0
1  NaN  NaN  12  15.0
2  NaN  NaN  13  16.0

In [449]:
pd.concat([dataframe1, dataframe2],axis=1)

   A  B  C   C   D
0  1  4  7  11  14
1  2  5  8  12  15
2  3  6  9  13  16

## Pandas - Merge Dataframe

In [452]:
diccionario = {'A':[1, 2, 3], 'B':[4, 5, 6], 'clave':['c1', 'c2','c3']}
dataframe1 = pd.DataFrame(diccionario)

In [454]:
dataframe1

   A  B clave
0  1  4    c1
1  2  5    c2
2  3  6    c3

In [456]:
diccionario = {'A':[11, 12, 13], 'B':[14, 15, 16], 'clave':['c1', 'c2','c3']}
dataframe2 = pd.DataFrame(diccionario)
dataframe2

    A   B clave
0  11  14    c1
1  12  15    c2
2  13  16    c3

In [458]:
pd.merge(dataframe1, dataframe2, on='clave')

   A_x  B_x clave  A_y  B_y
0    1    4    c1   11   14
1    2    5    c2   12   15
2    3    6    c3   13   16

## Pandas - Join DataFrame

In [461]:
import numpy as np
import pandas as pd

In [463]:
diccionario = {'A':[1, 2, 3], 'B':[4, 5, 6]}
dataframe1 = pd.DataFrame(diccionario)
dataframe1

   A  B
0  1  4
1  2  5
2  3  6

In [465]:
diccionario1 = {'A':[1, 2, 3, 4], 'B':[4, 5, 6, 7]}
dataframe1 = pd.DataFrame(diccionario1, index=['i1', 'i2','i3', 'i4'])
dataframe1

    A  B
i1  1  4
i2  2  5
i3  3  6
i4  4  7

In [467]:
diccionario2 = {'C':[11, 12, 13], 'D':[14, 15, 16]}
dataframe2 = pd.DataFrame(diccionario2, index=['i1', 'i2','i3'])
dataframe2

     C   D
i1  11  14
i2  12  15
i3  13  16

In [469]:
dataframe1.join(dataframe2)

    A  B     C     D
i1  1  4  11.0  14.0
i2  2  5  12.0  15.0
i3  3  6  13.0  16.0
i4  4  7   NaN   NaN

## Pandas - Operaciones

In [472]:
diccionario = {'A':[11, 12, 10, 12], 'B':[14, 18, 16, 17]}
dataframe = pd.DataFrame(diccionario, index=['i1', 'i2','i3', 'I4'])
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
I4  12  17

In [474]:
dataframe['A'].unique()

array([11, 12, 10], dtype=int64)

In [476]:
dataframe['A'].nunique()

3

In [478]:
dataframe['A'].value_counts()

12    2
11    1
10    1
Name: A, dtype: int64

In [480]:
def multiplicar(x):
    return x*2

In [482]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
I4  12  17

In [484]:
dataframe['A'].apply(multiplicar)

i1    22
i2    24
i3    20
I4    24
Name: A, dtype: int64

In [486]:
dataframe['A'].apply(lambda x: x*2)

i1    22
i2    24
i3    20
I4    24
Name: A, dtype: int64

In [488]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
I4  12  17

In [490]:
dataframe.drop('B', axis=1)

     A
i1  11
i2  12
i3  10
I4  12

In [492]:
dataframe.drop('i1')

     A   B
i2  12  18
i3  10  16
I4  12  17

In [494]:
dataframe

     A   B
i1  11  14
i2  12  18
i3  10  16
I4  12  17

In [496]:
dataframe.columns

Index(['A', 'B'], dtype='object')

In [498]:
dataframe.index

Index(['i1', 'i2', 'i3', 'I4'], dtype='object')

In [500]:
dataframe.sort_values('B')

     A   B
i1  11  14
i3  10  16
I4  12  17
i2  12  18